app/views/subcategories/show.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
>
<% category=Category.find(@subcategory.category_id) %>

SELECT "items".* FROM "items" WHERE "items"."subcategory_id" = 1
---
<div class='container'>
	<% Item.where(subcategory_id: @subcategory).in_groups_of(6, false).each do |group| %>