app/controllers/home_controller.rb

	def index
		@user=current_user
		@items = Item.all
		@categories = Category.all
---
SELECT "items".* FROM "items"
SELECT "categories".* FROM "categories"