app/controllers/items_controller.rb

INSERT INTO "items" ("name", "description", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sleeping bag"], ["description", "warm and comfy"], ["price", 200.0], ["user_id", 3], ["created_at", "2016-11-16 20:30:21.130788"], ["updated_at", "2016-11-16 20:30:21.130788"]]
---
  def create
    @item = Item.new
    @item.name = params[:item][:name]
    @item.description = params[:item][:description]
    @item.price = params[:item][:price]
    @item.user = current_user
    if @item.valid?
      @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]
---
  def delete
    item_to_delete = Item.find(params[:id])
    item_to_delete.destroy