app/views/categories/show.html.erb

SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" = ?  [["category_id", 1]]
---
<div class='container'>
     <% Subcategory.where(category_id: @category).in_groups_of(6, false).each do |group| %>